In [2]:
print("hello")

hello

In [3]:
import pandas as pd
df=pd.read_csv("weather_data.csv")
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [4]:
df.shape

(6, 4)

In [5]:
df.head(2)

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny

In [6]:
df.tail(2)

          day  temperature  windspeed  event
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [7]:
df[1:4]

          day  temperature  windspeed  event
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow

In [8]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
df["day"]

0    01-01-2017
1    01-02-2017
2    01-03-2017
3    01-04-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [10]:
df[['day','temperature']]

          day  temperature
0  01-01-2017           32
1  01-02-2017           35
2  01-03-2017           28
3  01-04-2017           24
4  01-05-2017           32
5  01-06-2017           31

In [11]:
#### operations on data frame
.
.
.
.

SyntaxError: invalid syntax (45092432.py, line 2)

In [ ]:
df["temperature"].max() #for running a function, put it outside the 3rd bracket

35

In [ ]:
df["temperature"]>30

0     True
1     True
2    False
3    False
4     True
5     True
Name: temperature, dtype: bool

In [ ]:
df[df["temperature"]>30] #for running a condition, use df again and then compare with condition
# puting a df outside implies that complete table will be printed based on the condition

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

0    01-01-2017
1    01-02-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [ ]:
df[['day','event']]

          day  event
0  01-01-2017   Rain
1  01-02-2017  Sunny
2  01-03-2017   Snow
3  01-04-2017   Snow
4  01-05-2017   Rain
5  01-06-2017  Sunny

In [ ]:
df.describe() # very useful, it gives all the statistical info of the integer tye columns in the table

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [ ]:
df["day"][df["temperature"]>30]  #here i have specified what part of the table i want, which comes under the given condition

0    01-01-2017
1    01-02-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [ ]:
df[["day","temperature"]][df["temperature"]>30]

          day  temperature
0  01-01-2017           32
1  01-02-2017           35
4  01-05-2017           32
5  01-06-2017           31

In [ ]:
#### SET_INDEX()
.
.
.
.
.
.

In [ ]:
df.index

Int64Index([32, 35, 28, 24, 32, 31], dtype='int64', name='temperature')

In [ ]:
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [ ]:
df.set_index("day")

            index  temperature  windspeed
day
01-01-2017      0           32          6
01-02-2017      1           35          7
01-03-2017      2           28          2
01-04-2017      3           24          7
01-05-2017      4           32          4
01-06-2017      5           31          2

In [ ]:
df

             windspeed  event
temperature
32                   6   Rain
35                   7  Sunny
28                   2   Snow
24                   7   Snow
32                   4   Rain
31                   2  Sunny

In [ ]:
df=pd.read_csv("weather_data.csv")
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [ ]:
df.set_index("day")

            temperature  windspeed  event
day
01-01-2017           32          6   Rain
01-02-2017           35          7  Sunny
01-03-2017           28          2   Snow
01-04-2017           24          7   Snow
01-05-2017           32          4   Rain
01-06-2017           31          2  Sunny

In [ ]:
df.set_index("day", inplace=True)
df 

### if you run this again then you will get error coz, once the
### day coloumn has been set to the index, the code won't be able
### to find 'day' in the table again nd will show key error.

            index  temperature  windspeed  event
day
01-01-2017      0           32          6   Rain
01-02-2017      1           35          7  Sunny
01-03-2017      2           28          2   Snow
01-04-2017      3           24          7   Snow
01-05-2017      4           32          4   Rain
01-06-2017      5           31          2  Sunny

In [ ]:
df

            temperature  windspeed  event
day
01-01-2017           32          6   Rain
01-02-2017           35          7  Sunny
01-03-2017           28          2   Snow
01-04-2017           24          7   Snow
01-05-2017           32          4   Rain
01-06-2017           31          2  Sunny

In [ ]:
df.loc['01-05-2017']

temperature      32
windspeed         4
event          Rain
Name: 01-05-2017, dtype: object

In [ ]:
df.reset_index(inplace=True)
df

NameError: name 'df' is not defined

In [ ]:
df.set_index("event", inplace=True)
df

              day  index  temperature  windspeed
event
Rain   01-01-2017      0           32          6
Sunny  01-02-2017      1           35          7
Snow   01-03-2017      2           28          2
Snow   01-04-2017      3           24          7
Rain   01-05-2017      4           32          4
Sunny  01-06-2017      5           31          2

In [ ]:
a=df.loc["Rain"]
a
####we can use this technique to find the rows rlated to a particular item

              day  index  temperature  windspeed
event
Rain   01-01-2017      0           32          6
Rain   01-05-2017      4           32          4